#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_key_pair.igsr5_macbook_pubkey: Refreshing state... [id=igsr5_macbook_pubkey]
module._3000_pub_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3116323686]
aws_security_group_rule.allow_all_ingress: Refreshing state... [id=sgrule-1814049158]
module._3000_pub_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3719636918]
aws_security_group_rule.allow_all_ingressegress: Refreshing state... [id=sgrule-661089437]
aws_cloudfront_distribution.igsr5: Refreshing state... [id=E1RBGUKSCTYFWY]
aws_lb.igsr5: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:loadbalancer/app/igsr5/e9df5a8fcd5a55c4]
aws_security_group.allow_all_sg: Refreshing state... [id=sg-0830ccb08d6f4bdba]
module._3000_pub_sg.aws_security_group.default: Refreshing state... [id=sg-0307c78408c8adacb]
aws_vpc.igsr5: Refreshing state... [id=vpc-0864c7ab6ca1d76a0]
aws_ssm_parameter.igsr5_time_management_slack_auth_user_id: Refreshing state... [id=/igsr5/time_management_slack/auth_user_id]
aws_ssm_parameter.igsr5_time_management_slack_dsn: Refreshing state... [id=/igsr5/time_management_slack/dsn]
aws_ssm_parameter.igsr5_time_management_slack_bot_user_oauth_token: Refreshing state... [id=/igsr5/time_management_slack/bot_user_oauth_token]
module.ecs_task_execution_role.data.aws_iam_policy_document.assume_role: Reading...
aws_db_parameter_group.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
module.ecs_task_execution_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=320642683]
aws_cloudfront_origin_access_identity.static-www: Refreshing state... [id=E13K0L3OQEMWND]
aws_s3_bucket.igsr5_images: Refreshing state... [id=igsr5-images]
data.aws_route53_zone.igsr5: Reading...
aws_db_option_group.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
aws_ecs_cluster.igsr5: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:799705073177:cluster/igsr5]
aws_ssm_parameter.igsr5_time_management_slack_signing_secret: Refreshing state... [id=/igsr5/time_management_slack/signing_secret]
data.aws_route53_zone.igsr5: Read complete after 2s [id=Z10382141794HJUVL4L9O]
aws_ecr_repository.igsr5: Refreshing state... [id=igsr5]
aws_s3_bucket.alb_log: Refreshing state... [id=alb-log-igsr5]
aws_cloudwatch_log_group.prod_time_management_bolt: Refreshing state... [id=/ecs/igsr5/prod/time_management_bolt]
aws_key_pair.igsr5_debug_server_key_pair: Refreshing state... [id=igsr5_debug_server]
aws_s3_bucket.athena: Refreshing state... [id=athena-igsr5]
aws_cloudwatch_log_group.prod_time_management_go: Refreshing state... [id=/ecs/igsr5/prod/time_management_go]
data.aws_iam_policy.ecs_task_execution_role_policy: Reading...
data.aws_ssm_parameter.amzn2_ami: Reading...
aws_ssm_parameter.igsr5_time_management_slack_app_token: Refreshing state... [id=/igsr5/time_management_slack/app_token]
aws_ssm_parameter.igsr5_time_management_slack_auth_user_name: Refreshing state... [id=/igsr5/time_management_slack/auth_user_name]
module.ecs_task_execution_role.aws_iam_role.default: Refreshing state... [id=ecs-task-execution]
data.aws_ssm_parameter.amzn2_ami: Read complete after 1s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]
aws_acm_certificate.igsr5: Refreshing state... [id=arn:aws:acm:ap-northeast-1:799705073177:certificate/93205524-ee35-4db3-a2ec-178c97088452]
aws_ecr_lifecycle_policy.igsr5: Refreshing state... [id=igsr5]
aws_route53_record.igsr5_certificate: Refreshing state... [id=Z10382141794HJUVL4L9O__3c5d11fe36cb523dbbd728056ce3e7e9.igsr5.com._CNAME]
aws_ecs_task_definition.igsr5_time_management_slack: Refreshing state... [id=igsr5_time_management_slack]
aws_route_table.igsr5_public: Refreshing state... [id=rtb-0e2514394e6106643]
module.http_pub_sg.aws_security_group.default: Refreshing state... [id=sg-06740004ab412e349]
module.ssh_sg.aws_security_group.default: Refreshing state... [id=sg-0bb0b7b3a437b6b53]
aws_route_table.igsr5_private: Refreshing state... [id=rtb-061509f2bc59e6ed4]
aws_internet_gateway.igsr5: Refreshing state... [id=igw-0bccf539544601095]
aws_subnet.igsr5_private_0: Refreshing state... [id=subnet-091453d20102a88ad]
module.mysql_sg.aws_security_group.default: Refreshing state... [id=sg-0002d9a5dda871298]
module.https_sg.aws_security_group.default: Refreshing state... [id=sg-083f2270afd84b519]
aws_subnet.igsr5_public_1: Refreshing state... [id=subnet-0978a0caf7b26a82f]
aws_subnet.igsr5_private_1: Refreshing state... [id=subnet-0411fd95b0c41875f]
module.time_management_slack_sg.aws_security_group.default: Refreshing state... [id=sg-0cde50fa76f677bf0]
aws_subnet.igsr5_public_0: Refreshing state... [id=subnet-0176f59801ec25c61]
module.http_sg.aws_security_group.default: Refreshing state... [id=sg-03790c62086c12f18]
module.vpc_endpoint_sg.aws_security_group.default: Refreshing state... [id=sg-017d47677fcdff7a6]
module.ssh_pub_sg.aws_security_group.default: Refreshing state... [id=sg-02cb64739330dde79]
aws_acm_certificate_validation.igsr5: Refreshing state... [id=2021-12-05 06:06:57 +0000 UTC]
module.http_pub_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1674549715]
data.aws_iam_policy.ecs_task_execution_role_policy: Read complete after 4s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.http_pub_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-925738967]
aws_route.igsr5_public: Refreshing state... [id=r-rtb-0e2514394e61066431080289494]
module.ssh_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2082516004]
module.ssh_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2018751517]
module.mysql_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4064317122]
module.mysql_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2767102]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-753097682]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1166082613]
aws_route_table_association.igsr5_public_1: Refreshing state... [id=rtbassoc-09e062f160e685898]
aws_route_table_association.igsr5_private_0: Refreshing state... [id=rtbassoc-0d89bb588ab1575e3]
aws_route_table_association.igsr5_private_1: Refreshing state... [id=rtbassoc-0b900a3894d983faf]
aws_db_subnet_group.igsr5: Refreshing state... [id=igsr5]
module.time_management_slack_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3983031859]
module.time_management_slack_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-280917491]
data.aws_iam_policy_document.ecs_task_execution: Reading...
data.aws_iam_policy_document.ecs_task_execution: Read complete after 0s [id=741314529]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-818754843]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2425059150]
aws_route_table_association.igsr5_public_0: Refreshing state... [id=rtbassoc-07c598e12997c883b]
module.ssh_pub_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-4036035448]
module.ssh_pub_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3525885301]
module.vpc_endpoint_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3638854328]
module.vpc_endpoint_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-4230927273]
aws_instance.igsr5_debug_server: Refreshing state... [id=i-01523047055773e58]
data.aws_iam_policy_document.igsr5_images: Reading...
aws_cloudfront_distribution.igsr5_images: Refreshing state... [id=E1XAVJF6X91WJL]
data.aws_iam_policy_document.igsr5_images: Read complete after 0s [id=1583214726]
module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::799705073177:policy/ecs-task-execution]
aws_s3_bucket_policy.igsr5_images: Refreshing state... [id=igsr5-images]
aws_db_instance.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20211124131639569600000001]
aws_route53_record.igsr5_images: Refreshing state... [id=Z10382141794HJUVL4L9O_images.igsr5.com_A]
data.aws_iam_policy_document.alb_log: Reading...
data.aws_iam_policy_document.alb_log: Read complete after 0s [id=2754620463]
aws_s3_bucket_policy.alb_log: Refreshing state... [id=alb-log-igsr5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.igsr5_gmo_practice_server will be created
  + resource "aws_instance" "igsr5_gmo_practice_server" {
      + ami                                  = "ami-03b1b78bb1da5122f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0176f59801ec25c61"
      + tags                                 = {
          + "Name" = "igsr5-gmo-practice-server"
        }
      + tags_all                             = {
          + "Name" = "igsr5-gmo-practice-server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-02cb64739330dde79",
          + "sg-06740004ab412e349",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.igsr5_isucon10_qualify will be created
  + resource "aws_instance" "igsr5_isucon10_qualify" {
      + ami                                  = "ami-03bbe60df80bdccc0"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0176f59801ec25c61"
      + tags                                 = {
          + "Name" = "igsr5_isucon10_qualify"
        }
      + tags_all                             = {
          + "Name" = "igsr5_isucon10_qualify"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-02cb64739330dde79",
          + "sg-06740004ab412e349",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_key_pair.igsr5_gmo_practice_server will be created
  + resource "aws_key_pair" "igsr5_gmo_practice_server" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "igsr5_gmo_practice_server"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCq60lia0S2EnAJfAj3r5y7+QGkXgDLLy4/ECv7d0Akd7t4JaJ49h9o2W3yByKlWJaLsHmocu4xbzk5h+L191los/DSQyUax+n2I1oHlYxyjUVS4OD+Zfi3JHBygcNApIuSvZY0yQR/1mmYHe5m3VCVFnQlVYHr/k45GxXLJR8NNpIABNmIMIhpEpVdlOtpF0nc0GDqBsBOMycwf2ffF7CSBszg7nlOQbgelFhIiielT7IAmFIGVI9JTjNfB49t8AjHefLrkwV16jZ10jkAK2qUQ0gFXJB8lDnow6SQYD+WHlkL26Qgj80e73wADyys4BWkVJYsc/lbX5iOZ/tqYaQGyZFcNIqByiF6At8Q8HjKbKxEt9bl85mYd90E7+c2E+qY5HmKmYqU4/ocIxXyIM6CuhI0oO6Z7kHe0EiZP32EMUWzIPwLB5nsMS+PFNlS3OD6L5fDCVAPfLbWhgH48nFu7nRoY9zzwaoHvqE3MYHy9N/6HC7xN5hJkOyA/lDf2eE= ichigo@Macbook.local"
      + tags_all        = (known after apply)
    }

  # aws_key_pair.igsr5_isucon10_qualify will be created
  + resource "aws_key_pair" "igsr5_isucon10_qualify" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "igsr5_isucon10_qualify"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCq60lia0S2EnAJfAj3r5y7+QGkXgDLLy4/ECv7d0Akd7t4JaJ49h9o2W3yByKlWJaLsHmocu4xbzk5h+L191los/DSQyUax+n2I1oHlYxyjUVS4OD+Zfi3JHBygcNApIuSvZY0yQR/1mmYHe5m3VCVFnQlVYHr/k45GxXLJR8NNpIABNmIMIhpEpVdlOtpF0nc0GDqBsBOMycwf2ffF7CSBszg7nlOQbgelFhIiielT7IAmFIGVI9JTjNfB49t8AjHefLrkwV16jZ10jkAK2qUQ0gFXJB8lDnow6SQYD+WHlkL26Qgj80e73wADyys4BWkVJYsc/lbX5iOZ/tqYaQGyZFcNIqByiF6At8Q8HjKbKxEt9bl85mYd90E7+c2E+qY5HmKmYqU4/ocIxXyIM6CuhI0oO6Z7kHe0EiZP32EMUWzIPwLB5nsMS+PFNlS3OD6L5fDCVAPfLbWhgH48nFu7nRoY9zzwaoHvqE3MYHy9N/6HC7xN5hJkOyA/lDf2eE= ichigo@Macbook.local"
      + tags_all        = (known after apply)
    }

  # aws_key_pair.igsr5_macbook_pubkey will be destroyed
  # (because aws_key_pair.igsr5_macbook_pubkey is not in configuration)
  - resource "aws_key_pair" "igsr5_macbook_pubkey" {
      - arn         = "arn:aws:ec2:ap-northeast-1:799705073177:key-pair/igsr5_macbook_pubkey" -> null
      - fingerprint = "fa:45:3c:f4:f8:71:90:33:bf:b9:9e:1a:44:9c:06:d0" -> null
      - id          = "igsr5_macbook_pubkey" -> null
      - key_name    = "igsr5_macbook_pubkey" -> null
      - key_pair_id = "key-04b4cb4d35371bcdc" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDei16t09wFRf8Ppt6E9gr+S8jUC2IS2ZPsy0dF0ZB+PV2N7P20+zy7p6EhZv76dQfRJLBETVBpTgUlepRq/HKhmxDINO0rh9ZEfpR/EepxQYh6J87GTHd4S0Jfd/UehuJblIwz4OkxRLJXuRJmZDXvG/vpX+mzIh0JIJgdATtfHyO4Aa+vol4owB7PfmitbjtPA+6GkC/X3hjlgO05+uhUy0QwAPp/8qLw7s58uerqx28n7ccCJMzyceBncOZFzI1wgjX3j7O0V8YvKCn5vnv8t3nmCoXiockwH9ZWsCsqNQkWGrbQQCaPm3IA3VFRXc93XsBEjgDvprmBtiuhwZYYJ+iIyaXbhl1Utm0WWMKwndwGb1S1DDkdkr6qMjQUGPAdt+n7nKTPmw/xeMkBP+okmjNzu/kGxQnVGX4Lu8FqN6RdHfy1s5FsjEk4phi+/l/RNtQsjVNNpQs0Ij3fLzf+g/KGUY5zK5KizjGoVDkAtVChV8hrzwdQ11DKY+kBox9uWbHjiiP7WD6DYINPPfjkIZ1KIjDTiV0NO1qzD5BY47e33Xby8zKlndN0tzGW6Ua3Mpeut6Ru3GoPp9wKYk8Pv2oD5NflFbvWhEA5HQVeL5lvWKYhipPrS+SuVwPSYacO4k2FohEXnOzKmGTGyaVQFMax1oXN/OSOSHqqCl4C9Q== tks.m1205@gmail.com" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_lb.igsr5 will be destroyed
  # (because aws_lb.igsr5 is not in configuration)
  - resource "aws_lb" "igsr5" {
      - arn                        = "arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:loadbalancer/app/igsr5/e9df5a8fcd5a55c4" -> null
      - arn_suffix                 = "app/igsr5/e9df5a8fcd5a55c4" -> null
      - dns_name                   = "igsr5-172765304.ap-northeast-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields = false -> null
      - enable_deletion_protection = true -> null
      - enable_http2               = true -> null
      - id                         = "arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:loadbalancer/app/igsr5/e9df5a8fcd5a55c4" -> null
      - idle_timeout               = 3600 -> null
      - internal                   = false -> null
      - ip_address_type            = "ipv4" -> null
      - load_balancer_type         = "application" -> null
      - name                       = "igsr5" -> null
      - security_groups            = [
          - "sg-083f2270afd84b519",
        ] -> null
      - subnets                    = [
          - "subnet-0176f59801ec25c61",
          - "subnet-0978a0caf7b26a82f",
        ] -> null
      - tags                       = {} -> null
      - tags_all                   = {} -> null
      - vpc_id                     = "vpc-0864c7ab6ca1d76a0" -> null
      - zone_id                    = "Z14GRHDCWA56QT" -> null

      - access_logs {
          - bucket  = "alb-log-igsr5" -> null
          - enabled = true -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0176f59801ec25c61" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0978a0caf7b26a82f" -> null
        }
    }

  # aws_security_group.allow_all_sg will be destroyed
  # (because aws_security_group.allow_all_sg is not in configuration)
  - resource "aws_security_group" "allow_all_sg" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:799705073177:security-group/sg-0830ccb08d6f4bdba" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0830ccb08d6f4bdba" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "allow-all-sg" -> null
      - owner_id               = "799705073177" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0864c7ab6ca1d76a0" -> null
    }

  # aws_security_group_rule.allow_all_ingress will be destroyed
  # (because aws_security_group_rule.allow_all_ingress is not in configuration)
  - resource "aws_security_group_rule" "allow_all_ingress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-1814049158" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0830ccb08d6f4bdba" -> null
      - self              = false -> null
      - to_port           = 65535 -> null
      - type              = "ingress" -> null
    }

  # aws_security_group_rule.allow_all_ingressegress will be destroyed
  # (because aws_security_group_rule.allow_all_ingressegress is not in configuration)
  - resource "aws_security_group_rule" "allow_all_ingressegress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-661089437" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-0830ccb08d6f4bdba" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module._3000_pub_sg.aws_security_group.default will be destroyed
  # (because aws_security_group.default is not in configuration)
  - resource "aws_security_group" "default" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:799705073177:security-group/sg-0307c78408c8adacb" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0307c78408c8adacb" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 3000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3000
            },
        ] -> null
      - name                   = "-3000-pub-sg" -> null
      - owner_id               = "799705073177" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0864c7ab6ca1d76a0" -> null
    }

  # module._3000_pub_sg.aws_security_group_rule.egress will be destroyed
  # (because aws_security_group_rule.egress is not in configuration)
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-3719636918" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-0307c78408c8adacb" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module._3000_pub_sg.aws_security_group_rule.ingress will be destroyed
  # (because aws_security_group_rule.ingress is not in configuration)
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 3000 -> null
      - id                = "sgrule-3116323686" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0307c78408c8adacb" -> null
      - self              = false -> null
      - to_port           = 3000 -> null
      - type              = "ingress" -> null
    }

Plan: 4 to add, 0 to change, 8 to destroy.

Warning: Redundant ignore_changes element

  on rds.tf line 46, in resource "aws_db_instance" "igsr5_sandbox":
  46: resource "aws_db_instance" "igsr5_sandbox" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`*